/*Реалізуй клас, що описує канцелярський маркер. У класі повинні бути такі компоненти:
поле, яке зберігає колір маркера;
поле, яке зберігає кількість чорнил у маркері (у відсотках);
метод для вводу (приймає рядок і виводить текст відповідним кольором; 
    текст виводиться до тих пір, поки в маркері є чорнило; 
    один не пробільний символ — це 0,5% чорнил у маркері).
Реалізуй клас, що описує маркер, який можна перезаправляти. Успадкуй цей клас від простого маркера і додай метод для заправки.*/

class Marker {
    constructor(color,amount) {
        this.color = color;
        this.amount = amount;
    }

    
}




// var something = ;
// var percent = something*100/total
// percent
