/*Запитай у користувача його вік і визначи, ким він є: дитиною (0-11), підлітком (12-17), дорослим (18_59) або пенсіонером (60 ...), передбач можливість введення невірних даних.*/

// 0 - 12 років - дитина
// 12 - 17 - підліток 
// 18 - 59 - дорослий
// 60 - ... - персіонер


const age = prompt('How old are you?');

if(age >= 0 && age < 12) {
    //console.log('Дитина');  
    alert ('Дитина');
} else if(age >= 12 && age < 17) {
    //console.log('Підліток');
    alert ('Підліток');
} else if(age >= 18 && age < 59) {
    //console.log('Дорослий');  
    alert ('Дорослий');  
} else {
    //console.log(Пенсіонер);
    alert ('Пенсіонер');
}


// Запитай у користувача число від 0 до 9 і виведи йому спецсимвол, який розташований на цій клавіші (1 !, 2 @, 3 # і т. д).

let i = 0;

while (i < 9) {
     console.log (i);
     i++;
 }

// Підрахуй суму всіх чисел в заданому користувачем діапазоні.

let x = prompt("Введіть початок діапазону","")
let n = prompt("Введіть кінець діапазону","")
let sum = 0;
 
while(x < n) { 
       x++;
       sum+=x;    
    } 
alert(sum)

// Запитай у користувача 2 числа і знайди найбільший спільний дільник.

alert('Введіть 2 числа, щоб знайти найбільший спільний дільник')
let a = prompt('Введіть перше число', '');
let b = prompt('Введіть друге число');
let c;

calc(a, b)
alert('Найбільший спільний дільник ' + a + ' и ' + b + ' буде: ' + c)

function calc(a, b) {
    let c;
    while (a != b) {
      if (a > b) {
        a = a - b;
  
      } else
      if (a < b) {
        c = a;
        a = b;
        b = c;
      }
  
    }
    return c = a
  }


// Запитай у користувача число і виведи всі дільники цього числа.

alert('Введіть число, щоб знайти всі його дільники')
let e = prompt('Введіть число', '');
let f;

for (let f = 1; f<=e; f++) {
    if (e % f == 0 && e==!e && e==!1) {
        alert(`всі дільники числа: ${f}`);
    }
}

// Запитай у користувача суму покупки і виведи суму до оплати зі знижкою:
// від 200 до 300 - знижка буде 3%; 
// від 300 до 500 - 5%;
// від 500 і вище - 7%.


const price = prompt('Яка сума покупки?');

if(price <= 200 && price < 300) {
    //console.log('знижка буде 3%');  
    alert ('знижка буде 3%');
} else if(price >= 300 && price < 500) {
    //console.log('знижка буде 5%');
    alert ('знижка буде 5%');
} else {
    //console.log(знижка буде 7%);
    alert ('знижка буде 7%');
}


// Зацикли відображення днів тижня таким чином: «День тижня. Хочеш побачити наступний день? » і так до тих пір, поки користувач натискає OK.

// let week;

// while (week < 9) {
//      console.log (i);
//      week++;
//  }